-- phpMyAdmin SQL Dump
-- version 4.4.7
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016-05-22 17:37:01
-- 服务器版本： 5.6.23-log
-- PHP Version: 5.6.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `sas`
--

-- --------------------------------------------------------

--
-- 表的结构 `allpost`
--

CREATE TABLE IF NOT EXISTS `allpost` (
  `ID` int(4) NOT NULL,
  `title` varchar(40) NOT NULL,
  `content` varchar(100) NOT NULL,
  `posttime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `endtime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '结束时间',
  `poster` varchar(20) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `allpost`
--

INSERT INTO `allpost` (`ID`, `title`, `content`, `posttime`, `endtime`, `poster`) VALUES
(5, '本月12日，领导检查', '本月十二日有领导检查，请各宿舍做好卫生工作。', '2016-04-06 13:20:45', '2016-04-07 14:47:46', 'wanglaoshi'),
(7, '美化宿舍', '宁德师范学院第六届美化宿舍活动将在2016年4月12日开始报名，报名截止日期为2016年4月22日。请各宿舍踊跃报名，比赛前三名将有丰富的奖励。', '2016-04-07 14:50:31', '0000-00-00 00:00:00', 'wanglaoshi');

-- --------------------------------------------------------

--
-- 表的结构 `dormitory`
--

CREATE TABLE IF NOT EXISTS `dormitory` (
  `ID` int(4) NOT NULL,
  `st1` varchar(8) NOT NULL COMMENT '学生1',
  `st2` varchar(8) NOT NULL COMMENT '学生2',
  `st3` varchar(8) NOT NULL COMMENT '学生3',
  `st4` varchar(8) NOT NULL COMMENT '学生4',
  `st5` varchar(8) NOT NULL COMMENT '学生5',
  `st6` varchar(8) NOT NULL COMMENT '学生6',
  `president` varchar(8) NOT NULL COMMENT '舍长',
  `dormnum` varchar(10) NOT NULL COMMENT '宿舍号',
  `prephone` varchar(12) NOT NULL COMMENT '舍长电话',
  `power` int(4) NOT NULL COMMENT '电费',
  `water` int(4) NOT NULL COMMENT '水费'
) ENGINE=InnoDB AUTO_INCREMENT=24 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `dormitory`
--

INSERT INTO `dormitory` (`ID`, `st1`, `st2`, `st3`, `st4`, `st5`, `st6`, `president`, `dormnum`, `prephone`, `power`, `water`) VALUES
(7, '张红', '李燕', '王晓', '秦舞', '苏珊', '李莉', '李莉', '1s101', '12345678915', 401, 154),
(8, '李云', '黄花', '赵敏', '张瑶', '周智', '何枚', '张瑶', '1s102', '13654789984', 517, 146),
(9, '张茱', '秦安安', '张琪', '钱默默', '吴漾', '李环', '吴漾', '1s103', '14723569879', 963, 429),
(10, '唐糖', '赵欢', '张菲', '王笑', '李棠', '钱倩', '唐糖', '1s104', '136547899877', 495, 670),
(11, '张晓', '王艳', '李妍', '赵芷若', '周芳芳', '郑丽', '李妍', '1s105', '14723567873', 888, 110),
(12, '张萍', '李丽红', '王溪', '窦晓菲', '贾雯', '李好', '贾雯', '1s106', '18796541234', 271, 152),
(13, '温如玉', '唐陌', '蒋如花', '李豫', '张靓', '张桦婷', '张桦婷', '1s107', '18796541245', 453, 272),
(14, '吴兰', '王芬', '陆菲菲', '杨燕', '沈珂', '欧阳燕', '欧阳燕', '1s108', '18245176150', 305, 233),
(15, '汪晨', '姜研', '蒋烨', '吴秋香', '万莉莉', '钱倩倩', '姜研', '1s109', '14723566876', 399, 341),
(16, '柳芳', '杜靓', '赵颖', '张莹莹', '李焕', '尹莉', '赵颖', '1s110', '14723569477', 903, 497),
(17, '张珊', '程研', '李菲菲', '王丽', '郭襄', '姜颖', '郭襄', '1s111', '14723269879', 152, 695),
(22, '张婷婷', '王芳', '陈夜纺', '李丽', '', '', '张婷婷', '1s112', '18612345678', 0, 0),
(23, '段自莲', '', '', '', '', '', '段自莲', '1s201', '18412345678', 0, 0);

-- --------------------------------------------------------

--
-- 表的结构 `files`
--

CREATE TABLE IF NOT EXISTS `files` (
  `ID` int(4) NOT NULL,
  `title` varchar(20) NOT NULL COMMENT '标题',
  `content` varchar(60) NOT NULL COMMENT '内容',
  `file` varchar(100) NOT NULL COMMENT '文件地址'
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `files`
--

INSERT INTO `files` (`ID`, `title`, `content`, `file`) VALUES
(5, '学生信息', '信息介绍', 'activity/20160428032632pm.doc');

-- --------------------------------------------------------

--
-- 表的结构 `message`
--

CREATE TABLE IF NOT EXISTS `message` (
  `ID` int(4) NOT NULL,
  `messager` varchar(10) NOT NULL COMMENT '留言者',
  `mestime` datetime DEFAULT '0000-00-00 00:00:00' COMMENT '留言时间',
  `content` varchar(100) NOT NULL COMMENT '内容',
  `replyID` int(4) NOT NULL DEFAULT '0' COMMENT '回复ID',
  `flag` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `message`
--

INSERT INTO `message` (`ID`, `messager`, `mestime`, `content`, `replyID`, `flag`) VALUES
(11, '张红', '2016-04-07 14:25:22', '请问什么时间来电？', 0, 1),
(12, '王芳', '2016-04-18 13:13:41', '大概晚上20点', 11, 0),
(13, '李燕', '2016-04-18 15:24:30', '什么时候来水？', 0, 1),
(14, '王芳', '2016-04-18 15:25:06', '下午5点。', 13, 0),
(18, '张红', '2016-05-03 14:09:40', '什么时间来电', 0, 1),
(19, '王芳', '2016-05-03 14:10:02', '晚上8点', 18, 0);

-- --------------------------------------------------------

--
-- 表的结构 `migrant`
--

CREATE TABLE IF NOT EXISTS `migrant` (
  `ID` int(4) NOT NULL,
  `name` varchar(10) NOT NULL COMMENT '姓名',
  `number` varchar(20) NOT NULL COMMENT '学号/身份证号',
  `phone` varchar(12) NOT NULL COMMENT '电话',
  `accesstime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '访问时间',
  `endtime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '结束时间',
  `reason` varchar(40) NOT NULL COMMENT '访问理由',
  `dormnum` varchar(20) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `migrant`
--

INSERT INTO `migrant` (`ID`, `name`, `number`, `phone`, `accesstime`, `endtime`, `reason`, `dormnum`) VALUES
(4, '李默', 'B1234567843', '14723456987', '2016-04-02 12:00:00', '2016-04-02 15:00:00', '修电脑', '1s101'),
(6, '王语嫣', 'B1234567842', '110', '2016-04-02 12:00:00', '2016-04-02 22:00:00', '过家家', '1s523'),
(7, '张三', 'B2012102123', '123464668', '2016-04-28 15:00:00', '2016-04-28 16:00:00', '修电脑', '1s101');

-- --------------------------------------------------------

--
-- 表的结构 `notice`
--

CREATE TABLE IF NOT EXISTS `notice` (
  `ID` int(11) NOT NULL,
  `title` varchar(20) NOT NULL,
  `content` varchar(60) NOT NULL,
  `posttime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00',
  `poster` varchar(30) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `notice`
--

INSERT INTO `notice` (`ID`, `title`, `content`, `posttime`, `poster`) VALUES
(3, '12日检查卫生', '本月十二日领导检查卫生，请做好卫生工作。', '2016-04-06 13:22:56', 'wanglaoshi'),
(4, '文明宿舍活动', '文明宿舍活动即将开始，到时请大家积极报名。', '2016-04-06 13:24:47', 'wanglaoshi'),
(5, ' 停电通知', '由于电路问题，学校6月6号早上8点开始停电。', '2016-04-06 13:32:56', 'wanglaoshi'),
(6, '停水通知', '由于外面施工队不小心把水管挖破了，学校蓄水即将不够，请同学们蓄好水。', '2016-04-06 13:35:30', 'wanglaoshi'),
(7, '停水通知', '明天会停水', '2016-04-18 15:04:44', '王芳'),
(8, '如同如同日让他', '恶业', '2016-04-27 17:23:29', '王芳'),
(9, '宿舍检查', '请大家做好宿舍卫生', '2016-04-28 15:21:57', '王芳');

-- --------------------------------------------------------

--
-- 表的结构 `power`
--

CREATE TABLE IF NOT EXISTS `power` (
  `ID` int(4) NOT NULL,
  `dormnum` varchar(8) NOT NULL COMMENT '宿舍号',
  `month` int(2) NOT NULL COMMENT '月份',
  `money` int(5) NOT NULL COMMENT '费用'
) ENGINE=InnoDB AUTO_INCREMENT=324 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `power`
--

INSERT INTO `power` (`ID`, `dormnum`, `month`, `money`) VALUES
(180, '1s101', 1, 175),
(181, '1s102', 1, 241),
(182, '1s103', 1, 226),
(183, '1s104', 1, 155),
(184, '1s105', 1, 104),
(185, '1s106', 1, 229),
(186, '1s107', 1, 180),
(187, '1s108', 1, 223),
(188, '1s109', 1, 236),
(189, '1s110', 1, 191),
(190, '1s111', 1, 137),
(191, '1s112', 1, 225),
(192, '1s101', 2, 229),
(193, '1s102', 2, 214),
(194, '1s103', 2, 104),
(195, '1s104', 2, 242),
(196, '1s105', 2, 181),
(197, '1s106', 2, 218),
(198, '1s107', 2, 216),
(199, '1s108', 2, 169),
(200, '1s109', 2, 110),
(201, '1s110', 2, 158),
(202, '1s111', 2, 240),
(203, '1s112', 2, 211),
(204, '1s101', 3, 165),
(205, '1s102', 3, 156),
(206, '1s103', 3, 224),
(207, '1s104', 3, 134),
(208, '1s105', 3, 184),
(209, '1s106', 3, 222),
(210, '1s107', 3, 156),
(211, '1s108', 3, 178),
(212, '1s109', 3, 236),
(213, '1s110', 3, 244),
(214, '1s111', 3, 194),
(215, '1s112', 3, 134),
(216, '1s101', 4, 131),
(217, '1s102', 4, 123),
(218, '1s103', 4, 170),
(219, '1s104', 4, 194),
(220, '1s105', 4, 114),
(221, '1s106', 4, 244),
(222, '1s107', 4, 235),
(223, '1s108', 4, 175),
(224, '1s109', 4, 167),
(225, '1s110', 4, 235),
(226, '1s111', 4, 247),
(227, '1s112', 4, 202),
(228, '1s101', 5, 108),
(229, '1s102', 5, 177),
(230, '1s103', 5, 194),
(231, '1s104', 5, 170),
(232, '1s105', 5, 144),
(233, '1s106', 5, 142),
(234, '1s107', 5, 108),
(235, '1s108', 5, 180),
(236, '1s109', 5, 116),
(237, '1s110', 5, 246),
(238, '1s111', 5, 205),
(239, '1s112', 5, 172),
(240, '1s101', 6, 108),
(241, '1s102', 6, 225),
(242, '1s103', 6, 160),
(243, '1s104', 6, 161),
(244, '1s105', 6, 242),
(245, '1s106', 6, 128),
(246, '1s107', 6, 250),
(247, '1s108', 6, 167),
(248, '1s109', 6, 177),
(249, '1s110', 6, 226),
(250, '1s111', 6, 164),
(251, '1s112', 6, 226),
(252, '1s101', 7, 243),
(253, '1s102', 7, 184),
(254, '1s103', 7, 209),
(255, '1s104', 7, 244),
(256, '1s105', 7, 138),
(257, '1s106', 7, 163),
(258, '1s107', 7, 219),
(259, '1s108', 7, 109),
(260, '1s109', 7, 210),
(261, '1s110', 7, 118),
(262, '1s111', 7, 153),
(263, '1s112', 7, 182),
(264, '1s101', 8, 116),
(265, '1s102', 8, 244),
(266, '1s103', 8, 180),
(267, '1s104', 8, 202),
(268, '1s105', 8, 250),
(269, '1s106', 8, 107),
(270, '1s107', 8, 213),
(271, '1s108', 8, 250),
(272, '1s109', 8, 234),
(273, '1s110', 8, 148),
(274, '1s111', 8, 214),
(275, '1s112', 8, 186),
(276, '1s101', 9, 165),
(277, '1s102', 9, 216),
(278, '1s103', 9, 157),
(279, '1s104', 9, 168),
(280, '1s105', 9, 228),
(281, '1s106', 9, 103),
(282, '1s107', 9, 227),
(283, '1s108', 9, 234),
(284, '1s109', 9, 214),
(285, '1s110', 9, 132),
(286, '1s111', 9, 135),
(287, '1s112', 9, 172),
(288, '1s101', 10, 231),
(289, '1s102', 10, 188),
(290, '1s103', 10, 124),
(291, '1s104', 10, 240),
(292, '1s105', 10, 235),
(293, '1s106', 10, 214),
(294, '1s107', 10, 161),
(295, '1s108', 10, 246),
(296, '1s109', 10, 214),
(297, '1s110', 10, 149),
(298, '1s111', 10, 219),
(299, '1s112', 10, 184),
(300, '1s101', 11, 152),
(301, '1s102', 11, 234),
(302, '1s103', 11, 249),
(303, '1s104', 11, 220),
(304, '1s105', 11, 161),
(305, '1s106', 11, 177),
(306, '1s107', 11, 214),
(307, '1s108', 11, 215),
(308, '1s109', 11, 209),
(309, '1s110', 11, 159),
(310, '1s111', 11, 184),
(311, '1s112', 11, 207),
(312, '1s101', 12, 182),
(313, '1s102', 12, 170),
(314, '1s103', 12, 149),
(315, '1s104', 12, 186),
(316, '1s105', 12, 192),
(317, '1s106', 12, 106),
(318, '1s107', 12, 166),
(319, '1s108', 12, 140),
(320, '1s109', 12, 244),
(321, '1s110', 12, 226),
(322, '1s111', 12, 241),
(323, '1s112', 12, 120);

-- --------------------------------------------------------

--
-- 表的结构 `property`
--

CREATE TABLE IF NOT EXISTS `property` (
  `ID` int(4) NOT NULL,
  `dormnum` varchar(10) NOT NULL COMMENT '宿舍号',
  `applicant` varchar(10) NOT NULL COMMENT '报修人',
  `phone` varchar(12) NOT NULL COMMENT '电话',
  `reason` varchar(40) NOT NULL COMMENT '报修原因',
  `protime` datetime NOT NULL DEFAULT '0000-00-00 00:00:00' COMMENT '报修时间',
  `material` varchar(40) NOT NULL COMMENT '材料',
  `fixer` varchar(10) NOT NULL COMMENT '维修人员',
  `fixphone` varchar(12) NOT NULL COMMENT '维修人电话',
  `flag` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否修理'
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `property`
--

INSERT INTO `property` (`ID`, `dormnum`, `applicant`, `phone`, `reason`, `protime`, `material`, `fixer`, `fixphone`, `flag`) VALUES
(4, '1s101', '张红', '12345678910', '水龙头坏了。', '2016-04-07 14:20:03', '', 'wanglaoshi', '12345454545', 1),
(10, '1s103', '张茱', '14723569875', '电风扇坏了。', '2016-04-18 13:21:52', '螺丝', '王芳', '', 1),
(11, '1s102', '黄花', '13654789986', '水龙头坏了。', '2016-04-18 13:24:22', '水龙头', '王芳', '13712345670', 1),
(12, '1s101', '李燕', '12345678911', '下水道堵了。', '2016-04-18 15:06:13', '水桶', '王芳', '13712345670', 1),
(13, '1s101', '李燕', '12345678911', '水龙头坏了', '2016-04-25 13:52:52', '', '', '', 0),
(14, '1s104', '唐糖', '136547899877', '电风扇坏了', '2016-04-28 15:17:34', '螺丝', '王芳', '13712345670', 1),
(15, '1s101', '张红', '12345678910', '水龙头坏了', '2016-05-03 14:08:08', '', '王芳', '13712345670', 1),
(16, '1s101', '张红', '12345678910', '电风扇坏了', '2016-05-03 14:18:20', '', '', '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `staff`
--

CREATE TABLE IF NOT EXISTS `staff` (
  `ID` int(4) NOT NULL,
  `username` varchar(20) NOT NULL COMMENT '教职工账号',
  `password` varchar(40) NOT NULL COMMENT '密码',
  `realname` varchar(20) NOT NULL,
  `phone` varchar(12) NOT NULL COMMENT '电话',
  `job` varchar(8) NOT NULL COMMENT '职务',
  `email` varchar(40) NOT NULL COMMENT '邮箱'
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `staff`
--

INSERT INTO `staff` (`ID`, `username`, `password`, `realname`, `phone`, `job`, `email`) VALUES
(11, 'S1234567801', 'e10adc3949ba59abbe56e057f20f883e', '王芳', '13712345670', '宿管', '123456@163.com'),
(12, 'S1234567802', 'e10adc3949ba59abbe56e057f20f883e', '张萍', '13712345660', '宿管', '123457@163.com'),
(13, 'S1234567803', 'e10adc3949ba59abbe56e057f20f883e', '李梅', '13712345671', '宿管', '123458@163.com'),
(14, 'S1234567804', 'e10adc3949ba59abbe56e057f20f883e', '赵琳', '13712345672', '宿管', '123459@163.com'),
(15, 'S1234567816', 'e10adc3949ba59abbe56e057f20f883e', '赵焱', '13712345684', '物业', '123471@163.com'),
(16, 'S1234567817', 'e10adc3949ba59abbe56e057f20f883e', '邓伟华', '13712345685', '物业', '123472@163.com'),
(17, 'S1234567818', 'e10adc3949ba59abbe56e057f20f883e', '钱杨', '13712345686', '物业', '123473@163.com');

-- --------------------------------------------------------

--
-- 表的结构 `student`
--

CREATE TABLE IF NOT EXISTS `student` (
  `ID` int(20) NOT NULL,
  `susername` varchar(20) NOT NULL COMMENT '学生账号',
  `password` varchar(50) NOT NULL COMMENT '密码',
  `number` varchar(20) NOT NULL COMMENT '学号',
  `phone` varchar(12) NOT NULL COMMENT '电话',
  `sex` varchar(2) NOT NULL COMMENT '性别',
  `classnum` varchar(20) NOT NULL COMMENT '班级',
  `teacher` varchar(10) NOT NULL COMMENT '辅导员',
  `depart` varchar(10) NOT NULL COMMENT '系别',
  `dormnum` varchar(20) NOT NULL COMMENT '宿舍号',
  `gohome` int(4) NOT NULL COMMENT '晚归'
) ENGINE=InnoDB AUTO_INCREMENT=133 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `student`
--

INSERT INTO `student` (`ID`, `susername`, `password`, `number`, `phone`, `sex`, `classnum`, `teacher`, `depart`, `dormnum`, `gohome`) VALUES
(26, '张红', '202cb962ac59075b964b07152d234b70', 'B1234567890', '12345678910', '', '应用英语', '秦墨', '', '1s101', 6),
(27, '李燕', '202cb962ac59075b964b07152d234b70', 'B1234567891', '12345678911', '', '应用英语', '秦墨', '', '1s101', 3),
(28, '王晓', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567896', '12345678912', '', '应用英语', '秦墨', '', '1s101', 1),
(29, '秦舞', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567893', '12345678913', '', '应用英语', '秦墨', '', '1s101', 0),
(30, '苏珊', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567894', '12345678914', '', '应用英语', '秦墨', '', '1s101', 0),
(31, '李莉', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567895', '12345678915', '', '应用英语', '秦墨', '', '1s101', 0),
(32, '李云', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678901', '13654789987', '', '实用物理', '唐宸', '', '1s102', 0),
(33, '黄花', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678902', '13654789986', '', '实用物理', '唐宸', '', '1s102', 0),
(34, '赵敏', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678903', '13654789985', '', '实用物理', '唐宸', '', '1s102', 5),
(35, '张瑶', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678904', '13654789984', '', '实用物理', '唐宸', '', '1s102', 0),
(36, '周智', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678905', '13654789983', '', '应用英语', '秦墨', '', '1s102', 0),
(37, '何枚', 'e10adc3949ba59abbe56e057f20f883e', 'B1345678906', '13654789982', '', '应用英语', '秦墨', '', '1s102', 0),
(38, '张茱', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567880', '14723569875', '', '汉语言文学', '沈菲', '', '1s103', 0),
(39, '秦安安', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567881', '14723569876', '', '汉语言文学', '沈菲', '', '1s103', 0),
(40, '张琪', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567882', '14723569877', '', '汉语言文学', '沈菲', '', '1s103', 0),
(41, '钱默默', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567883', '14723569878', '', '汉语言文学', '沈菲', '', '1s103', 0),
(42, '吴漾', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567884', '14723569879', '', '汉语言文学', '沈菲', '', '1s103', 0),
(43, '李环', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567885', '14723569870', '', '汉语言文学', '沈菲', '', '1s103', 0),
(44, '唐糖', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567870', '136547899877', '', '汉语言文学', '沈菲', '', '1s104', 0),
(45, '赵欢', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567871', '136547899876', '', '汉语言文学', '沈菲', '', '1s104', 0),
(46, '张菲', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567872', '136547899875', '', '汉语言文学', '沈菲', '', '1s104', 1),
(47, '王笑', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567873', '136547899878', '', '汉语言文学', '沈菲', '', '1s104', 0),
(48, '李棠', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567874', '136547899874', '', '汉语言文学', '沈菲', '', '1s104', 0),
(49, '钱倩', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567875', '136547899873', '', '汉语言文学', '沈菲', '', '1s104', 1),
(50, '张晓', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567886', '14723567875', '', '汉语言文学', '沈菲', '', '1s105', 0),
(51, '王艳', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567887', '14723567874', '', '汉语言文学', '沈菲', '', '1s105', 0),
(52, '李妍', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567888', '14723567873', '', '汉语言文学', '沈菲', '', '1s105', 0),
(53, '赵芷若', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567889', '14723567872', '', '汉语言文学', '沈菲', '', '1s105', 0),
(54, '周芳芳', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567876', '14723567871', '', '汉语言文学', '沈菲', '', '1s105', 0),
(55, '郑丽', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567877', '14723567870', '', '汉语言文学', '沈菲', '', '1s105', 0),
(56, '张萍', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567860', '18796541230', '', '汉语言文学', '沈菲', '', '1s106', 0),
(57, '李丽红', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567861', '18796541231', '', '汉语言文学', '沈菲', '', '1s106', 0),
(58, '王溪', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567862', '18796541232', '', '汉语言文学', '沈菲', '', '1s106', 0),
(59, '窦晓菲', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567863', '18796541233', '', '汉语言文学', '沈菲', '', '1s106', 0),
(60, '贾雯', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567864', '18796541234', '', '汉语言文学', '沈菲', '', '1s106', 0),
(61, '李好', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567865', '18796541235', '', '汉语言文学', '沈菲', '', '1s106', 0),
(62, '温如玉', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567760', '18796541240', '', '酒店管理', '凌夜', '', '1s107', 0),
(63, '唐陌', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567761', '18796541241', '', '酒店管理', '凌夜', '', '1s107', 0),
(64, '蒋如花', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567762', '18796541242', '', '酒店管理', '凌夜', '', '1s107', 0),
(65, '李豫', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567763', '18796541243', '', '酒店管理', '凌夜', '', '1s107', 0),
(66, '张靓', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567764', '18796541244', '', '酒店管理', '凌夜', '', '1s107', 0),
(67, '张桦婷', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567765', '18796541245', '', '酒店管理', '凌夜', '', '1s107', 0),
(68, '吴兰', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567780', '18245176155', '', '酒店管理', '凌夜', '', '1s108', 0),
(69, '王芬', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567782', '18245176154', '', '酒店管理', '凌夜', '', '1s108', 0),
(70, '陆菲菲', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567781', '18245176153', '', '酒店管理', '凌夜', '', '1s108', 0),
(71, '杨燕', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567783', '18245176152', '', '酒店管理', '凌夜', '', '1s108', 0),
(72, '沈珂', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567784', '18245176151', '', '酒店管理', '凌夜', '', '1s108', 0),
(73, '欧阳燕', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567785', '18245176150', '', '酒店管理', '凌夜', '', '1s108', 0),
(74, '汪晨', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567850', '14723566875', '', '酒店管理', '凌夜', '', '1s109', 0),
(75, '姜研', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567851', '14723566876', '', '酒店管理', '凌夜', '', '1s109', 0),
(76, '蒋烨', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567852', '14723566877', '', '酒店管理', '凌夜', '', '1s109', 0),
(77, '吴秋香', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567853', '14723566878', '', '酒店管理', '凌夜', '', '1s109', 0),
(78, '万莉莉', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567854', '14723566879', '', '酒店管理', '凌夜', '', '1s109', 0),
(79, '钱倩倩', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567855', '14723566870', '', '酒店管理', '凌夜', '', '1s109', 0),
(80, '柳芳', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567290', '14723569475', '', '学前教育', '欧阳烨', '', '1s110', 0),
(81, '杜靓', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567291', '14723569476', '', '学前教育', '欧阳烨', '', '1s110', 0),
(82, '赵颖', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567292', '14723569477', '', '学前教育', '欧阳烨', '', '1s110', 0),
(83, '张莹莹', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567293', '14723569478', '', '学前教育', '欧阳烨', '', '1s110', 0),
(84, '李焕', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567294', '14723569479', '', '学前教育', '欧阳烨', '', '1s110', 0),
(85, '尹莉', 'e10adc3949ba59abbe56e057f20f883e', 'B1234567295', '14723569470', '', '学前教育', '欧阳烨', '', '1s110', 0),
(86, '张珊', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676911', '14723269875', '', '学前教育', '欧阳烨', '', '1s111', 0),
(87, '程研', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676912', '14723269876', '', '学前教育', '欧阳烨', '', '1s111', 0),
(88, '李菲菲', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676913', '14723269877', '', '学前教育', '欧阳烨', '', '1s111', 0),
(89, '王丽', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676914', '14723269878', '', '学前教育', '欧阳烨', '', '1s111', 0),
(90, '郭襄', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676915', '14723269879', '', '学前教育', '欧阳烨', '', '1s111', 0),
(91, '姜颖', 'e10adc3949ba59abbe56e057f20f883e', 'B1345676916', '14723269870', '', '学前教育', '欧阳烨', '', '1s111', 0),
(116, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(117, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(118, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(119, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(120, '段誉', 'e10adc3949ba59abbe56e057f20f883e', 'B2012103103', '120', '', '14师范', '氟利昂', '', '1s523', 0),
(121, '张婷婷', 'e10adc3949ba59abbe56e057f20f883e', 'B2016103101', '18612345678', '', '16通信', '王宥', '', '1s112', 0),
(122, '王芳', 'e10adc3949ba59abbe56e057f20f883e', 'B2016103102', '18612345679', '', '16通信', '王宥', '', '1s112', 0),
(123, '陈夜纺', 'e10adc3949ba59abbe56e057f20f883e', 'B2016103103', '18612345670', '', '16通信', '王宥', '', '1s112', 0),
(124, '李丽', 'e10adc3949ba59abbe56e057f20f883e', 'B2016103104', '18612345671', '', '16通信', '王宥', '', '1s112', 0),
(125, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(126, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(127, '段自莲', 'e10adc3949ba59abbe56e057f20f883e', 'B2016103145', '18412345678', '', '16通信', '王宥', '', '1s201', 0),
(128, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(129, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(130, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(131, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0),
(132, '', 'e10adc3949ba59abbe56e057f20f883e', '', '', '', '', '', '', '', 0);

-- --------------------------------------------------------

--
-- 表的结构 `vote`
--

CREATE TABLE IF NOT EXISTS `vote` (
  `ID` int(4) NOT NULL,
  `dormnum` varchar(10) NOT NULL COMMENT '宿舍号',
  `votes` int(4) NOT NULL DEFAULT '0' COMMENT '票数',
  `upload` varchar(100) NOT NULL COMMENT '图片',
  `works` varchar(40) NOT NULL COMMENT '作品名称',
  `activity` varchar(20) NOT NULL,
  `flag` tinyint(1) NOT NULL DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `vote`
--

INSERT INTO `vote` (`ID`, `dormnum`, `votes`, `upload`, `works`, `activity`, `flag`) VALUES
(13, '1s101', 0, 'activity/20160406023434pm.jpg', '桑树', '本月12日，领导检查', 1),
(14, '1s101', 0, 'activity/20160406023500pm.jpg', '二维', '本月12日，领导检查', 1),
(15, '1s101', 3, 'activity/20160406023512pm.jpg', '斯蒂夫', '本月12日，领导检查', 1),
(16, '1s101', 1, 'activity/20160407022316pm.jpg', '择宸', '本月12日，领导检查', 1),
(23, '1s101', 0, 'activity/20160423090218am.jpg', '凌云阁', '美化宿舍', 0),
(24, '1s103', 2, 'activity/20160423090349am.jpg', '欢乐居', '美化宿舍', 0),
(25, '1s102', 1, 'activity/20160423090542am.jpg', '静安居', '美化宿舍', 0),
(29, '1s107', 0, 'activity/20160428062109pm.jpg', '糖果屋', '美化宿舍', 0);

-- --------------------------------------------------------

--
-- 表的结构 `water`
--

CREATE TABLE IF NOT EXISTS `water` (
  `ID` int(4) NOT NULL,
  `month` int(2) NOT NULL COMMENT '月份',
  `money` int(4) NOT NULL COMMENT '费用',
  `dormnum` varchar(10) NOT NULL COMMENT '宿舍号'
) ENGINE=InnoDB AUTO_INCREMENT=157 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `water`
--

INSERT INTO `water` (`ID`, `month`, `money`, `dormnum`) VALUES
(13, 1, 233, '1s101'),
(14, 1, 157, '1s102'),
(15, 1, 250, '1s103'),
(16, 1, 233, '1s104'),
(17, 1, 122, '1s105'),
(18, 1, 242, '1s106'),
(19, 1, 227, '1s107'),
(20, 1, 223, '1s108'),
(21, 1, 194, '1s109'),
(22, 1, 103, '1s110'),
(23, 1, 122, '1s111'),
(24, 1, 109, '1s112'),
(25, 2, 150, '1s101'),
(26, 2, 241, '1s102'),
(27, 2, 123, '1s103'),
(28, 2, 216, '1s104'),
(29, 2, 243, '1s105'),
(30, 2, 167, '1s106'),
(31, 2, 232, '1s107'),
(32, 2, 120, '1s108'),
(33, 2, 135, '1s109'),
(34, 2, 180, '1s110'),
(35, 2, 126, '1s111'),
(36, 2, 249, '1s112'),
(37, 3, 146, '1s101'),
(38, 3, 238, '1s102'),
(39, 3, 134, '1s103'),
(40, 3, 232, '1s104'),
(41, 3, 173, '1s105'),
(42, 3, 190, '1s106'),
(43, 3, 181, '1s107'),
(44, 3, 176, '1s108'),
(45, 3, 110, '1s109'),
(46, 3, 128, '1s110'),
(47, 3, 105, '1s111'),
(48, 3, 106, '1s112'),
(49, 4, 123, '1s101'),
(50, 4, 193, '1s102'),
(51, 4, 175, '1s103'),
(52, 4, 148, '1s104'),
(53, 4, 202, '1s105'),
(54, 4, 242, '1s106'),
(55, 4, 180, '1s107'),
(56, 4, 142, '1s108'),
(57, 4, 246, '1s109'),
(58, 4, 127, '1s110'),
(59, 4, 230, '1s111'),
(60, 4, 217, '1s112'),
(61, 5, 178, '1s101'),
(62, 5, 141, '1s102'),
(63, 5, 198, '1s103'),
(64, 5, 108, '1s104'),
(65, 5, 150, '1s105'),
(66, 5, 112, '1s106'),
(67, 5, 126, '1s107'),
(68, 5, 246, '1s108'),
(69, 5, 176, '1s109'),
(70, 5, 222, '1s110'),
(71, 5, 134, '1s111'),
(72, 5, 124, '1s112'),
(73, 6, 149, '1s101'),
(74, 6, 159, '1s102'),
(75, 6, 160, '1s103'),
(76, 6, 130, '1s104'),
(77, 6, 166, '1s105'),
(78, 6, 203, '1s106'),
(79, 6, 173, '1s107'),
(80, 6, 227, '1s108'),
(81, 6, 229, '1s109'),
(82, 6, 105, '1s110'),
(83, 6, 157, '1s111'),
(84, 6, 237, '1s112'),
(85, 7, 224, '1s101'),
(86, 7, 168, '1s102'),
(87, 7, 239, '1s103'),
(88, 7, 247, '1s104'),
(89, 7, 184, '1s105'),
(90, 7, 237, '1s106'),
(91, 7, 139, '1s107'),
(92, 7, 249, '1s108'),
(93, 7, 186, '1s109'),
(94, 7, 160, '1s110'),
(95, 7, 157, '1s111'),
(96, 7, 203, '1s112'),
(97, 8, 170, '1s101'),
(98, 8, 228, '1s102'),
(99, 8, 243, '1s103'),
(100, 8, 144, '1s104'),
(101, 8, 234, '1s105'),
(102, 8, 222, '1s106'),
(103, 8, 114, '1s107'),
(104, 8, 150, '1s108'),
(105, 8, 213, '1s109'),
(106, 8, 225, '1s110'),
(107, 8, 146, '1s111'),
(108, 8, 182, '1s112'),
(109, 9, 237, '1s101'),
(110, 9, 235, '1s102'),
(111, 9, 202, '1s103'),
(112, 9, 103, '1s104'),
(113, 9, 234, '1s105'),
(114, 9, 134, '1s106'),
(115, 9, 114, '1s107'),
(116, 9, 128, '1s108'),
(117, 9, 248, '1s109'),
(118, 9, 173, '1s110'),
(119, 9, 187, '1s111'),
(120, 9, 211, '1s112'),
(121, 10, 130, '1s101'),
(122, 10, 185, '1s102'),
(123, 10, 225, '1s103'),
(124, 10, 229, '1s104'),
(125, 10, 108, '1s105'),
(126, 10, 144, '1s106'),
(127, 10, 200, '1s107'),
(128, 10, 196, '1s108'),
(129, 10, 124, '1s109'),
(130, 10, 146, '1s110'),
(131, 10, 138, '1s111'),
(132, 10, 157, '1s112'),
(133, 11, 108, '1s101'),
(134, 11, 235, '1s102'),
(135, 11, 135, '1s103'),
(136, 11, 176, '1s104'),
(137, 11, 108, '1s105'),
(138, 11, 123, '1s106'),
(139, 11, 180, '1s107'),
(140, 11, 182, '1s108'),
(141, 11, 213, '1s109'),
(142, 11, 211, '1s110'),
(143, 11, 229, '1s111'),
(144, 11, 129, '1s112'),
(145, 12, 249, '1s101'),
(146, 12, 149, '1s102'),
(147, 12, 111, '1s103'),
(148, 12, 119, '1s104'),
(149, 12, 163, '1s105'),
(150, 12, 212, '1s106'),
(151, 12, 114, '1s107'),
(152, 12, 111, '1s108'),
(153, 12, 181, '1s109'),
(154, 12, 129, '1s110'),
(155, 12, 176, '1s111'),
(156, 12, 100, '1s112');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `allpost`
--
ALTER TABLE `allpost`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `dormitory`
--
ALTER TABLE `dormitory`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `files`
--
ALTER TABLE `files`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `message`
--
ALTER TABLE `message`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `migrant`
--
ALTER TABLE `migrant`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `notice`
--
ALTER TABLE `notice`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `power`
--
ALTER TABLE `power`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `property`
--
ALTER TABLE `property`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `staff`
--
ALTER TABLE `staff`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `vote`
--
ALTER TABLE `vote`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `water`
--
ALTER TABLE `water`
  ADD PRIMARY KEY (`ID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `allpost`
--
ALTER TABLE `allpost`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `dormitory`
--
ALTER TABLE `dormitory`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=24;
--
-- AUTO_INCREMENT for table `files`
--
ALTER TABLE `files`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT for table `message`
--
ALTER TABLE `message`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=20;
--
-- AUTO_INCREMENT for table `migrant`
--
ALTER TABLE `migrant`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT for table `notice`
--
ALTER TABLE `notice`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=10;
--
-- AUTO_INCREMENT for table `power`
--
ALTER TABLE `power`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=324;
--
-- AUTO_INCREMENT for table `property`
--
ALTER TABLE `property`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=17;
--
-- AUTO_INCREMENT for table `staff`
--
ALTER TABLE `staff`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=18;
--
-- AUTO_INCREMENT for table `student`
--
ALTER TABLE `student`
  MODIFY `ID` int(20) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=133;
--
-- AUTO_INCREMENT for table `vote`
--
ALTER TABLE `vote`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=30;
--
-- AUTO_INCREMENT for table `water`
--
ALTER TABLE `water`
  MODIFY `ID` int(4) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=157;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
